12/data/attachments/c1d20b82dfca4735.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_b585d80b-ed86-486a-bcf5-b496beb7c3cf</nif:username>
            <nif:friendToBeAdded>Erin_source_Actions_21656_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>